app/views/notes/_sidebar.html.erb

SELECT "ncategories".* FROM "ncategories"
---
		<%= link_to 'Все заметки', notes_path %>
	<% if !Ncategory.all.blank? %>