app/views/notes/index.html.erb

SELECT "notes".* FROM "notes"
SELECT tags.*, COUNT(*) AS count FROM "tags" LEFT OUTER JOIN taggings ON tags.id = taggings.tag_id AND taggings.context = 'tags' INNER JOIN notes ON notes.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Note') AND (taggings.taggable_id IN(SELECT notes.id FROM "notes")) GROUP BY tags.id, tags.name HAVING COUNT(*) > 0
---
						  <ul>
                             <% Note.tag_counts.each do |tag| %>