app/views/notes/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags".id = "taggings".tag_id WHERE (("taggings".taggable_id = 3) AND ("taggings".taggable_type = 'Note') AND ((taggings.tagger_id IS NULL AND taggings.context = 'tags')))
---
              <strong>Тэги:</strong>
              <% @note.tags.each do |f| %>