app/controllers/ncategories_controller.rb

SELECT "ncategories".* FROM "ncategories"
---
  def index
    @ncategories = Ncategory.all

SELECT "ncategories".* FROM "ncategories" WHERE ("ncategories"."id" = 1) LIMIT 1
---
  def show
    @ncategory = Ncategory.find(params[:id])

INSERT INTO "ncategories" ("created_at", "title", "updated_at") VALUES ('2010-11-30 20:04:29.194304', 'Букмарки', '2010-11-30 20:04:29.194304')
---
  def create
    @ncategory = Ncategory.new(params[:ncategory])
    if @ncategory.save