app/controllers/notes_categories_controller.rb

  def index
    @notes_categories = NotesCategory.all
---
SELECT "notes_categories".* FROM "notes_categories"

  def show
    @notes_category = NotesCategory.find(params[:id])
---
SELECT "notes_categories".* FROM "notes_categories" WHERE ("notes_categories"."id" = 1) LIMIT 1

  def create
    @notes_category = NotesCategory.new(params[:notes_category])
    if @notes_category.save
---
INSERT INTO "notes_categories" ("created_at", "title", "updated_at") VALUES ('2010-11-30 18:53:12.126670', 'Букмарки', '2010-11-30 18:53:12.126670')