app/controllers/notes_controller.rb

  def show
    @note = Note.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE ("notes"."id" = 1) LIMIT 1

  def create
    @note = Note.new(params[:note])
    if @note.save
---
INSERT INTO "notes" ("content", "created_at", "notes_category_id", "notescategory_id", "sharable", "title", "updated_at", "url") VALUES ('Yep, already', '2010-11-30 19:44:48.744787', 1, NULL, 'f', 'SecondTestNote', '2010-11-30 19:44:48.744787', '')

  def edit
    @note = Note.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE ("notes"."id" = 2) LIMIT 1

  def update
    @note = Note.find(params[:id])
    if @note.update_attributes(params[:note])
---
SELECT "notes".* FROM "notes" WHERE ("notes"."id" = 2) LIMIT 1
UPDATE "notes" SET "content" = '6 лет я старательно избегал всех фильмов серии Пила. Наверное, это связано с тем, что я крайне редко (буквально один раз в год) смотрю какие бы то ни было страшилки. Например, за весь 2009-ый лишь Зеркала были удостоены моего внимания. Наблюдать, как каждый год выходит новая часть Пилы было весело; каждый раз в голову приходила одна и та же мысль “ну, сняли они что-то стоящее n лет назад, а вот теперь опять сделали нелепое унылое продолжение для выкачки денег, фи”.', "updated_at" = '2011-01-21 14:07:16.944928' WHERE ("notes"."id" = 3)

  def destroy
    @note = Note.find(params[:id])
    @note.destroy
---
SELECT "notes".* FROM "notes" WHERE ("notes"."id" = 1) LIMIT 1
DELETE FROM "notes" WHERE ("notes"."id" = 1)