app/views/ncategories/show.html.erb

</p>
<% if !@ncategory.notes.blank? %>
---
SELECT "notes".* FROM "notes" WHERE ("notes".ncategory_id = 1)